[
  {
    "version": "2.0.0",
    "date": "tbd",
    "changes": [
      "Added punishuntimelydanktime setting",
      "Increased maximum points for a dank time to 10000",
      "Improved the plugin framework",
      "Performed a tech refresh"
    ]
  },
  {
    "version": "1.7.0",
    "date": "2018-08-26",
    "changes": [
      "Added support for DankTimeBot plugins!",
      "Revamped the way settings are handled by the bot. Instead of an individual command for each setting, all settings are now set via the new /set command. This means all old setter commands have been removed",
      "Added /settingshelp, which prints descriptions of all settings. /settings continues to print the values of all settings",
      "Added new settings: handicaps.multiplier, handicaps.bottomfraction, and hardcoremode.punishfraction",
      "If no one has called a dank time following a dank time announcement, said announcement is now removed one minute later"
    ]
  },
  {
    "version": "1.6.0",
    "date": "2018-01-20",
    "changes": [
      "It is no longer possible to have a negative score",
      "Replaced /releases with /whatsnew, which shows the release notes of the current version only",
      "Chats from which the bot is removed are now removed from the bot data",
      "Fixed a bug that caused the arrow emojis on the leaderboard to sometimes be incorrect"
    ]
  },
  {
    "version": "1.5.0",
    "date": "2017-12-23",
    "changes": [
      "Users whose score is 0 are now removed from the leaderboard on nightly updates",
      "When a user is the only user in a chat, they no longer benefit from handicap mode",
      "The bot now prints its version in the console on launch",
      "Gave the developer (i.e. me) admin-level access to all bot commands",
      "Fixed a bug that caused hardcore mode to set a user's score to 0 if their score was negative"
    ]
  },
  {
    "version": "1.4.0",
    "date": "2017-12-22",
    "changes": [
      "Added a toggleable handicap mode, which rewards the users with the lowest scores",
      "It is now possible to have sentences as texts for dank times",
      "Increased hardcore mode punishment to user scores from 10 points to 10% of user scores",
      "When a user leaves a chat, they are now removed from the leaderboard",
      "Added emoji's here and there to lighten the mood",
      "Fixed a bug that caused random dank times to sometimes overlap with other (random) dank times",
      "Fixed a bug that caused timezones starting with lowercase to sometimes crash the server"
    ]
  },
  {
    "version": "1.3.2",
    "date": "2017-08-20",
    "changes": [
      "Fixed a bug where removing a DankTime would remove that DankTime and every DankTime after it"
    ]
  },
  {
    "version": "1.3.1",
    "date": "2017-08-15",
    "changes": [
      "Added the hardcore mode setting to the output of /settings",
      "Fixed a bug that caused the texts of random dank times to be messed up",
      "For server admins: updated the dockerfile to more properly handle launching the bot",
      "Also for server admins: moved 'releases.json' from the data folder to the project root"
    ]
  },
  {
    "version": "1.3.0",
    "date": "2017-08-14",
    "changes": [
      "Implemented a toggleable hardcore mode, in which every day, users who did not score the previous day are punished",
      "Fixed a bug that allowed a dank time to have the same text more than once",
      "Renamed 'settings.json' to 'config.json' for semantic reasons",
      "The 'What's new?' message is now sent only on the first bot launch. To resend the message on a subsequent launch, set the 'sendWhatsNewMsg' value in config.json to 'true'",
      "For developers: translated the entire bot from JavaScript to TypeScript!"
    ]
  },
  {
    "version": "1.2.0",
    "date": "2017-07-25",
    "changes": [
      "Added the /setmultiplier command to set a custom multiplier for the points of the first user to score",
      "Added the /togglefirstnotifications command to enable or disable announcements about which user scored first",
      "The leaderboard now shows changes in ranks via arrow emojis",
      "Changed the command names and the output of /help to reflect the style of BotFather",
      "Split the /toggle_notifications command into /toggledanktimenotifications and /toggleautoleaderboards",
      "Split the /settings command into /settings and /danktimes",
      "The leaderboard is no longer automatically printed after a dank time if nobody scored",
      "Messages read by the bot that were sent more than a minute earlier are now ignored",
      "When a group is upgraded to a supergroup, the scores and settings are now maintained",
      "The bot name is now retrieved dynamically from the Telegram API when the bot is started on the server"
    ]
  },
  {
    "version": "1.1.0",
    "date": "2017-07-08",
    "changes": [
      "It is now possible for a dank time to have multiple words that can be typed to score points",
      "It is now possible for multiple dank times to share the same word(s)",
      "The words you need to type to score points for dank times are no longer case-sensitive",
      "Notifications are no longer sent only for random dank times, but also for normal dank times",
      "When a dank time has ended, the leaderboard is now printed",
      "Added the /toggle_notifications command to enable or disable the behavior of the above two changes",
      "Added the /stop command which stops the bot",
      "Added the /releases command which prints the release logs",
      "When the bot is (re)started on the server it now sends a 'what's new?' message to all chats",
      "Bot data is now saved when the bot stops on the server, so no more data loss when it crashes or updates!",
      "The /reset command now requires confirmation before doing the reset",
      "Fixed a bug where notifications for existing random dank times would not be sent after the bot was restarted on the server",
      "Fixed a bug where typing a bot command mid-sentence would execute that command",
      "Added a README to the repository containing info and tutorials about the bot"
    ]
  }
]